require "Wrong/assert"
include Wrong::Assert

=begin
  (3)
  Получить треугольник Паскаля
  В верхней строке пишутся две единицы.
  Все  последующие строки начинаются и заканчиваются еденицами.
  Промежуточные числа получаются сложением соседних чисел вышестоящей строки.
=end

def solution(n)
  return [] if n < 0
  r = [1]
  res = [r]
  while n > 0
    rn = [1]
    for i in (0..r.size - 2)
      rn << r[i] + r[i + 1]
    end
    r = (rn << 1)
    res << rn
    n -= 1
  end
  res
end

assert{ solution(-10) == []}
assert{ solution(0) == [[1]]}
assert{ solution(1) == [[1], [1, 1]] }
assert{ solution(2) == [[1], [1, 1], [1, 2, 1]] }

assert{ solution(5) == [
         [1],
       [1, 1],
      [1, 2, 1],
    [1, 3, 3, 1],
  [1, 4, 6, 4, 1],
[1, 5, 10, 10, 5, 1]
] }

assert{ solution(10) == [
                         [1],
                       [1, 1],
                     [1, 2, 1],
                   [1, 3, 3, 1],
                  [1, 4, 6, 4, 1],
               [1, 5, 10, 10, 5, 1],
             [1, 6, 15, 20, 15, 6, 1],
           [1, 7, 21, 35, 35, 21, 7, 1],
        [1, 8, 28, 56, 70, 56, 28, 8, 1],
     [1, 9, 36, 84, 126, 126, 84, 36, 9, 1],
[1, 10, 45, 120, 210, 252, 210, 120, 45, 10, 1]
] }